MoseychukA/1-GIT-ReceiverRTL1090/ESP32/Soft/ESP32_RTLSDR_24_12_05_05 нет/librtlsdr.cpp

#include "Arduino.h"
#include "librtlsdr.h"
#include "usb/usb_host.h"
#include "esp_intr_alloc.h"
#include <errno.h>
#include <signal.h>
#include <string.h>
#include <stdio.h>
#include <stdlib.h>
#include "esp_log.h"
//#include "esp32_psram.h"
#include "esp32-hal-psram.h"

#include "main.h"

#ifndef _WIN32
#include <unistd.h>
#define min(a, b) (((a) < (b)) ? (a) : (b))
#endif


/* two raised to the power of n */
#define TWO_POW(n) ((double)(1ULL << (n)))

//#include "rtl-sdr.h"
#include "tuner_r82xx.h"


void init_adsb_dev()
{
    adsbdev = (class_adsb_dev*)ps_calloc(1, sizeof(class_adsb_dev));
    adsbdev->is_adsb = true;
}

void bulk_transfer_read_cb(usb_transfer_t* transfer)
{
    // printf("BULK: actual_num_bytes %d\n", transfer->actual_num_bytes);

    for (int i = 0; i < transfer->actual_num_bytes; i++)
    {
        adsbdev->response_buf[i] = transfer->data_buffer[i];
    }
    adsbdev->is_done = true;
    adsbdev->is_success = transfer->status == 0;
    adsbdev->bytes_transferred = transfer->num_bytes;
    printf("BULK: Transfer:Read type %d\n", transfer->num_bytes);
    printf("BULK: Transfer:Read status %d, actual number of bytes transferred %d, databuffer size %d, %d\n", transfer->status, transfer->actual_num_bytes, transfer->data_buffer_size, adsbdev->response_buf[8]);
    //!! Здесь проблема!! Передача, так как было отправлено больше данных, чем было запрошено
}
static void transfer_read_cb(usb_transfer_t* transfer)
{
    for (int i = 0; i < transfer->actual_num_bytes; i++)
    {
        adsbdev->response_buf[i] = transfer->data_buffer[i];
    }
    adsbdev->is_done = true;
    //   printf("Transfer:Read type %d %ld \n", transfer->actual_num_bytes, transfer->flags);
    //  printf("Transfer:Read status %d, actual number of bytes transferred %d, databuffer size %d, %d\n", transfer->status, transfer->actual_num_bytes, transfer->data_buffer[8], adsbdev->response_buf[8]);
}
int esp_libusb_bulk_transfer(class_driver_t* driver_obj, unsigned char endpoint, unsigned char* data, int length, int* transferred, unsigned int timeout)
{
    fprintf(stderr, "**!!** esp_libusb_bulk_transfer info %X %d %d %d\n", endpoint, length, timeout, *transferred);
    assert(driver_obj->dev_hdl != NULL);
    size_t sizePacket = usb_round_up_to_mps(length, 64);
    usb_transfer_t* transfer = NULL;
    esp_err_t err;
    err = usb_host_transfer_alloc(sizePacket, 0, &transfer);
    if (err != ESP_OK)
    {
        transfer = NULL;
        fprintf(stderr, "!!**usb_host_transfer_alloc In fail: %x\n", err);
    }
    else
    {
        fprintf(stderr, "**!!**usb_host_transfer_alloc In Ok!: %x\n", err);
    }

    //fprintf(stderr, "esp_libusb_bulk_transfer usb_host_transfer_alloc %d\n", sizePacket);
    transfer->num_bytes = sizePacket;
    transfer->device_handle = driver_obj->dev_hdl;
    transfer->bEndpointAddress = endpoint;
    transfer->callback = bulk_transfer_read_cb; //массовая передача чтения
    transfer->context = (void*)&driver_obj;
    transfer->timeout_ms = timeout;
    adsbdev->is_done = false;
    adsbdev->response_buf = (uint8_t*)ps_calloc(sizePacket, sizeof(uint8_t));

    fprintf(stderr, "transfer->num_bytes %d\n", transfer->num_bytes);
    fprintf(stderr, "transfer->device_handle %d\n", transfer->device_handle);
    fprintf(stderr, "transfer->bEndpointAddress %x\n", transfer->bEndpointAddress);
    fprintf(stderr, "transfer->callback %d\n", transfer->callback);
    fprintf(stderr, "transfer->context %d\n", transfer->context);
    fprintf(stderr, "transfer->timeout_ms %d\n", transfer->timeout_ms);

    /**
* @brief Освобождение объекта передачи
*
* - Освобождение объекта передачи, ранее выделенного с помощью usb_host_transfer_alloc()
* - Передача не должна быть в процессе при попытке ее освобождения
* - Если передан указатель NULL, эта функция просто вернет ESP_OK
*
* @param[in] transfer Объект передачи
* @return esp_err_t
*/
    esp_err_t r = usb_host_transfer_free(transfer);


    /**
  * - Отправить неконтролируемый перевод
  * - Отправить перевод на определенную конечную точку. Устройство и номер конечной точки указываются внутри перевода
  * - Перед отправкой перевод должен быть правильно инициализирован
  * - По завершении обратный вызов перевода будет вызван из функции usb_host_client_handle_events() клиента.
  *
  * @param[in] перевод Инициализированный объект перевода
  * @return esp_err_t
  */

    r = usb_host_transfer_submit(transfer); // Эта функция отправляет запрос на передачу данных и немедленно возвращает значение. Возвращает 0 в случае успеха

    if (r != ESP_OK)
    {
        fprintf(stderr, "!!!!!esp_libusb_bulk_transfer failed with % d\n", r);
        return -1;
    }
    else
    {
        fprintf(stderr, "!!!!!esp_libusb_bulk_transfer OK!! with % d\n", r);
    }


    //fprintf(stderr, "!!!!!!adsbdev->is_done % d\n", !adsbdev->is_done);
    while (!adsbdev->is_done)
    {
        /**
        * @brief Функция обработки клиента USB Host Library
        *
        * - Эта функция обрабатывает всю обработку клиента и должна вызываться многократно в цикле
        * - Для конкретного клиента эта функция никогда не должна вызываться несколькими потоками одновременно
        *
        * @note Эта функция может блокировать
        * @param[in] client_hdl Дескриптор клиента
        * @param[in] timeout_ticks Тайм-аут в тиках для ожидания события
        * @return esp_err_t
        */

        fprintf(stderr, "!!!!!!adsbdev->is_done % d\n", !adsbdev->is_done);
        fprintf(stderr, "!!!!!client_hdl % d\n", driver_obj->client_hdl);
        usb_host_client_handle_events(driver_obj->client_hdl, portMAX_DELAY);  // 

        err = usb_host_client_handle_events(driver_obj->client_hdl, portMAX_DELAY);
        if ((err != ESP_OK) && (err != ESP_ERR_TIMEOUT))
        {
            fprintf(stderr, "*!!!!* usb_host_client_handle_events: %x\n", err);
        }
        else
        {
            fprintf(stderr, "*!!!!* usb_host_client_handle_events Ok!!: %x\n", err);
        }
    }

    // adsbdev->is_success = 1;
    // fprintf(stderr, "*!!!!* adsbdev->is_success %d\n", adsbdev->is_success);

    // int tst_is_success = adsbdev->is_success;

    if (!adsbdev->is_success)
    {
        fprintf(stderr, "!!!!esp_libusb_bulk_transfer failed\n");
        return -1;
    }

