MoseychukA/1-GIT-ReceiverRTL1090/ESP32/Soft/ESP32_RTLSDR_24_12_05_05 нет/librtlsdr.cpp
    ESP_ERROR_CHECK(usb_host_endpoint_clear(driver_obj->dev_hdl, endpoint));
    for (int i = 0; i < length; i++)
    {
        data[i] = adsbdev->response_buf[i];
    }
    *transferred = adsbdev->bytes_transferred;
    usb_host_transfer_free(transfer);
    return 0;
}

bool libusb_control_transfer(class_driver_t* driver_obj, uint8_t bm_req_type, uint8_t b_request, uint16_t wValue, uint16_t wIndex, unsigned char* data, uint16_t wLength, unsigned int timeout)
{
    //usb_host_transfer_free(adsbdev->transfer);
    ESP_ERROR_CHECK(usb_host_transfer_free(adsbdev->transfer));
    free(adsbdev->response_buf);
    size_t sizePacket = sizeof(usb_setup_packet_t) + wLength;
    usb_host_transfer_alloc(sizePacket, 0, &adsbdev->transfer);
    USB_SETUP_PACKET_INIT_CONTROL((usb_setup_packet_t*)adsbdev->transfer->data_buffer, bm_req_type, b_request, wValue, wIndex, wLength);
    adsbdev->transfer->num_bytes = sizePacket;
    adsbdev->transfer->device_handle = driver_obj->dev_hdl;
    adsbdev->transfer->timeout_ms = timeout;
    adsbdev->transfer->context = (void*)&driver_obj;
    adsbdev->transfer->callback = transfer_read_cb;
    adsbdev->is_done = false;
    adsbdev->response_buf = (uint8_t*)calloc(sizePacket, sizeof(uint8_t));

    if (bm_req_type == CTRL_OUT)
    {
        for (uint8_t i = 0; i < wLength; i++)
        {
            adsbdev->transfer->data_buffer[sizeof(usb_setup_packet_t) + i] = data[i];
        }
    }
    esp_err_t r = usb_host_transfer_submit_control(driver_obj->client_hdl, adsbdev->transfer);
    if (r != ESP_OK)
    {
        ESP_LOGI(TAG_LIBRTLSDR, "libusb_control_transfer failed with %d", r);
        return false;
    }

    while (!adsbdev->is_done)
    {
        usb_host_client_handle_events(driver_obj->client_hdl, portMAX_DELAY);
    }
    for (uint8_t i = 0; i < wLength; i++)
    {
        data[i] = adsbdev->response_buf[sizeof(usb_setup_packet_t) + i];
    }
    return true;
}


void rtlsdr_set_gpio_bit(rtlsdr_dev_t* dev, uint8_t gpio, int val);
static int rtlsdr_set_if_freq(rtlsdr_dev_t* dev, uint32_t freq);

/* generic tuner interface functions, shall be moved to the tuner implementations */

int r820t_init(void* dev)
{
    rtlsdr_dev_t* devt = (rtlsdr_dev_t*)dev;
    devt->r82xx_p.rtl_dev = dev;

    if (devt->tuner_type == RTLSDR_TUNER_R828D)
    {
        devt->r82xx_c.i2c_addr = R828D_I2C_ADDR;
        devt->r82xx_c.rafael_chip = CHIP_R828D;
    }
    else
    {
        devt->r82xx_c.i2c_addr = R820T_I2C_ADDR;
        devt->r82xx_c.rafael_chip = CHIP_R820T;
    }

    rtlsdr_get_xtal_freq(devt, NULL, &devt->r82xx_c.xtal);

    devt->r82xx_c.max_i2c_msg_len = 8;
    devt->r82xx_c.use_predetect = 0;
    devt->r82xx_p.cfg = &devt->r82xx_c;

    return r82xx_init(&devt->r82xx_p);
}
int r820t_exit(void* dev)
{
    rtlsdr_dev_t* devt = (rtlsdr_dev_t*)dev;
    return r82xx_standby(&devt->r82xx_p);
}

int r820t_set_freq(void* dev, uint32_t freq)
{
    rtlsdr_dev_t* devt = (rtlsdr_dev_t*)dev;
    return r82xx_set_freq(&devt->r82xx_p, freq);
}

int r820t_set_bw(void* dev, int bw)
{
    int r;
    rtlsdr_dev_t* devt = (rtlsdr_dev_t*)dev;

    r = r82xx_set_bandwidth(&devt->r82xx_p, bw, devt->rate);
    if (r < 0)
        return r;
    r = rtlsdr_set_if_freq(devt, r);
    if (r)
        return r;
    return rtlsdr_set_center_freq(devt, devt->freq);
}

int r820t_set_gain(void* dev, int gain)
{
    rtlsdr_dev_t* devt = (rtlsdr_dev_t*)dev;
    return r82xx_set_gain(&devt->r82xx_p, 1, gain);
}
int r820t_set_gain_mode(void* dev, int manual)
{
    rtlsdr_dev_t* devt = (rtlsdr_dev_t*)dev;
    return r82xx_set_gain(&devt->r82xx_p, manual, 0);
}

int rtlsdr_read_array(rtlsdr_dev_t* dev, uint8_t block, uint16_t addr, uint8_t* array, uint8_t len)
{
    uint16_t index = (block << 8);
    unsigned char* data = (unsigned char*)ps_calloc(len, sizeof(char));
    int ret = libusb_control_transfer(dev->driver_obj, CTRL_IN, 0, addr, index, data, len, CTRL_TIMEOUT);
    //fprintf(stderr, "rtlsdr_read_array here %d %d\n", ret, data[0]);
    *array = data[0];
    return ret;
}

int rtlsdr_write_array(rtlsdr_dev_t* dev, uint8_t block, uint16_t addr, uint8_t* array, uint8_t len)
{
    uint16_t index = (block << 8) | 0x10;
    unsigned char* data = (unsigned char*)ps_calloc(len, sizeof(char));
    data[0] = *array;
    int ret = libusb_control_transfer(dev->driver_obj, CTRL_OUT, 0, addr, index, data, len, CTRL_TIMEOUT);
    //fprintf(stderr, "rtlsdr_write_array here %d\n", ret);
    free(data);
    return ret;
}

int rtlsdr_i2c_write_reg(rtlsdr_dev_t* dev, uint8_t i2c_addr, uint8_t reg, uint8_t val)
{
    uint16_t addr = i2c_addr;
    uint8_t data[2];

    data[0] = reg;
    data[1] = val;
    return rtlsdr_write_array(dev, IICB, addr, (uint8_t*)&data, 2);
}

uint8_t rtlsdr_i2c_read_reg(rtlsdr_dev_t* dev, uint8_t i2c_addr, uint8_t reg)
{
    uint16_t addr = i2c_addr;
    uint8_t data = 0;

    rtlsdr_write_array(dev, IICB, addr, &reg, 1);
    rtlsdr_read_array(dev, IICB, addr, &data, 1);

    return data;
}

int rtlsdr_i2c_write(rtlsdr_dev_t* dev, uint8_t i2c_addr, uint8_t* buffer, int len)
{
    uint16_t addr = i2c_addr;

    if (!dev)
        return -1;

    return rtlsdr_write_array(dev, IICB, addr, buffer, len);
}

int rtlsdr_i2c_read(rtlsdr_dev_t* dev, uint8_t i2c_addr, uint8_t* buffer, int len)
{
    uint16_t addr = i2c_addr;

    if (!dev)
        return -1;

    return rtlsdr_read_array(dev, IICB, addr, buffer, len);
}

uint16_t rtlsdr_read_reg(rtlsdr_dev_t* dev, uint8_t block, uint16_t addr, uint8_t len)
{
    unsigned char data[2];
    uint16_t index = (block << 8);
    uint16_t reg;

    int r = libusb_control_transfer(dev->driver_obj, CTRL_IN, 0, addr, index, data, len, CTRL_TIMEOUT);
    fprintf(stderr, "rtlsdr_read_reg here %d\n", r);
    if (r < 0)
        fprintf(stderr, "%s failed\n", __FUNCTION__);

    reg = (data[1] << 8) | data[0];

    return reg;
}

int rtlsdr_write_reg(rtlsdr_dev_t* dev, uint8_t block, uint16_t addr, uint16_t val, uint8_t len)
{
    unsigned char data[2];

    uint16_t index = (block << 8) | 0x10;

    if (len == 1)
        data[0] = val & 0xff;
    else
        data[0] = val >> 8;

    data[1] = val & 0xff;

    int r = libusb_control_transfer(dev->driver_obj, CTRL_OUT, 0, addr, index, data, len, CTRL_TIMEOUT);
   // fprintf(stderr, "rtlsdr_write_reg here %d\n", r);
    if (r < 0)
        fprintf(stderr, "%s failed\n", __FUNCTION__);

    return r;
}

uint16_t rtlsdr_demod_read_reg(rtlsdr_dev_t* dev, uint8_t page, uint16_t addr, uint8_t len)
{
    unsigned char data[2] = { 0, 0 };
    uint16_t index = page;
    uint16_t reg;
    addr = (addr << 8) | 0x20;

