MoseychukA/1-GIT-ReceiverRTL1090/ESP32/Soft/ESP32_RTLSDR_24_12_05_05 нет/librtlsdr.cpp
    return 0;
}

void esp_libusb_get_string_descriptor_ascii(const usb_str_desc_t* str_desc, char* str)
{
    if (str_desc == NULL)
    {
        return;
    }

    for (int i = 0; i < str_desc->bLength / 2; i++)
    {
        str[i] = (char)str_desc->wData[i];
    }
}


int rtlsdr_get_usb_strings(rtlsdr_dev_t* dev, char* manufact, char* product, char* serial)
{
    assert(dev->driver_obj->dev_hdl != NULL);
    usb_device_info_t dev_info;
    ESP_ERROR_CHECK(usb_host_device_info(dev->driver_obj->dev_hdl, &dev_info));
    const int buf_max = 256;

    if (dev_info.str_desc_manufacturer)
    {
        memset(manufact, 0, buf_max);
        esp_libusb_get_string_descriptor_ascii(dev_info.str_desc_manufacturer, manufact);
    }

    if (dev_info.str_desc_product)
    {
        memset(product, 0, buf_max);
        esp_libusb_get_string_descriptor_ascii(dev_info.str_desc_product, product);
    }

    if (dev_info.str_desc_serial_num)
    {
        memset(serial, 0, buf_max);
        esp_libusb_get_string_descriptor_ascii(dev_info.str_desc_serial_num, serial);
    }

    return 0;
}

int rtlsdr_write_eeprom(rtlsdr_dev_t* dev, uint8_t* data, uint8_t offset, uint16_t len)
{
    int r = 0;
    int i;
    uint8_t cmd[2];

    if (!dev)
        return -1;

    if ((len + offset) > 256)
        return -2;

    for (i = 0; i < len; i++)
    {
        cmd[0] = i + offset;
        r = rtlsdr_write_array(dev, IICB, EEPROM_ADDR, cmd, 1);
        r = rtlsdr_read_array(dev, IICB, EEPROM_ADDR, &cmd[1], 1);

        /* only write the byte if it differs */
        if (cmd[1] == data[i])
            continue;

        cmd[1] = data[i];
        r = rtlsdr_write_array(dev, IICB, EEPROM_ADDR, cmd, 2);
        if (r != sizeof(cmd))
            return -3;
        usleep(5000);
    }

    return 0;
}

int rtlsdr_read_eeprom(rtlsdr_dev_t* dev, uint8_t* data, uint8_t offset, uint16_t len)
{
    int r = 0;
    int i;

    if (!dev)
        return -1;

    if ((len + offset) > 256)
        return -2;

    r = rtlsdr_write_array(dev, IICB, EEPROM_ADDR, &offset, 1);
    if (r < 0)
        return -3;

    for (i = 0; i < len; i++)
    {
        r = rtlsdr_read_array(dev, IICB, EEPROM_ADDR, data + i, 1);

        if (r < 0)
            return -3;
    }

    return r;
}

int rtlsdr_set_center_freq(rtlsdr_dev_t* dev, uint32_t freq)
{
    int r = -1;

    if (!dev || !dev->tuner)
        return -1;

    if (dev->direct_sampling)
    {
        r = rtlsdr_set_if_freq(dev, freq);
    }
    else if (dev->tuner && dev->tuner->set_freq)
    {
        rtlsdr_set_i2c_repeater(dev, 1);
        r = dev->tuner->set_freq(dev, freq - dev->offs_freq);
        rtlsdr_set_i2c_repeater(dev, 0);
    }

    if (!r)
        dev->freq = freq;
    else
        dev->freq = 0;

    return r;
}

uint32_t rtlsdr_get_center_freq(rtlsdr_dev_t* dev)
{
    if (!dev)
        return 0;

    return dev->freq;
}

int rtlsdr_set_freq_correction(rtlsdr_dev_t* dev, int ppm)
{
    int r = 0;

    if (!dev)
        return -1;

    if (dev->corr == ppm)
        return -2;

    dev->corr = ppm;

    r |= rtlsdr_set_sample_freq_correction(dev, ppm);

    /* read corrected clock value into e4k and r82xx structure */
    if (rtlsdr_get_xtal_freq(dev, NULL, &dev->r82xx_c.xtal))
        return -3;

    if (dev->freq) /* retune to apply new correction value */
        r |= rtlsdr_set_center_freq(dev, dev->freq);

    return r;
}

int rtlsdr_get_freq_correction(rtlsdr_dev_t* dev)
{
    if (!dev)
        return 0;

    return dev->corr;
}

enum rtlsdr_tuner rtlsdr_get_tuner_type(rtlsdr_dev_t* dev)
{
    if (!dev)
        return RTLSDR_TUNER_UNKNOWN;

    return dev->tuner_type;
}

int rtlsdr_get_tuner_gains(rtlsdr_dev_t* dev, int* gains)
{
    /* all gain values are expressed in tenths of a dB */

    const int r82xx_gains[] = { 0, 9, 14, 27, 37, 77, 87, 125, 144, 157,
                               166, 197, 207, 229, 254, 280, 297, 328,
                               338, 364, 372, 386, 402, 421, 434, 439,
                               445, 480, 496 };
    const int unknown_gains[] = { 0 /* no gain values */ };

    const int* ptr = NULL;
    int len = 0;

    if (!dev)
        return -1;

    switch (dev->tuner_type)
    {
    case RTLSDR_TUNER_R820T:
    case RTLSDR_TUNER_R828D:
        ptr = r82xx_gains;
        len = sizeof(r82xx_gains);
        break;
    default:
        ptr = unknown_gains;
        len = sizeof(unknown_gains);
        break;
    }

    if (!gains)
    { /* no buffer provided, just return the count */
        return len / sizeof(int);
    }
    else
    {
        if (len)
            memcpy(gains, ptr, len);

        return len / sizeof(int);
    }
}

int rtlsdr_set_tuner_bandwidth(rtlsdr_dev_t* dev, uint32_t bw)
{
    int r = 0;

    if (!dev || !dev->tuner)
        return -1;

    if (dev->tuner->set_bw)
    {
        rtlsdr_set_i2c_repeater(dev, 1);
        r = dev->tuner->set_bw(dev, bw > 0 ? bw : dev->rate);
        rtlsdr_set_i2c_repeater(dev, 0);
        if (r)
            return r;
        dev->bw = bw;
    }
    return r;
}

int rtlsdr_set_tuner_gain(rtlsdr_dev_t* dev, int gain)
{
    int r = 0;

    if (!dev || !dev->tuner)
        return -1;

    if (dev->tuner->set_gain)
    {
        rtlsdr_set_i2c_repeater(dev, 1);
        r = dev->tuner->set_gain((void*)dev, gain);
        rtlsdr_set_i2c_repeater(dev, 0);
    }

    if (!r)
        dev->gain = gain;
    else
        dev->gain = 0;

    return r;
}

int rtlsdr_get_tuner_gain(rtlsdr_dev_t* dev)
{
    if (!dev)
        return 0;

    return dev->gain;
}

int rtlsdr_set_tuner_if_gain(rtlsdr_dev_t* dev, int stage, int gain)
{
    int r = 0;

    if (!dev || !dev->tuner)
        return -1;

    if (dev->tuner->set_if_gain)
    {
        rtlsdr_set_i2c_repeater(dev, 1);
        r = dev->tuner->set_if_gain(dev, stage, gain);
        rtlsdr_set_i2c_repeater(dev, 0);
    }

    return r;
}

int rtlsdr_set_tuner_gain_mode(rtlsdr_dev_t* dev, int mode)
{
    int r = 0;

    if (!dev || !dev->tuner)
        return -1;

