MoseychukA/1-GIT-ReceiverRTL1090/ESP32/Soft/ESP32_RTLSDR_24_12_05_05 нет/librtlsdr.cpp
    if (dev->tuner->set_gain_mode)
    {
        rtlsdr_set_i2c_repeater(dev, 1);
        r = dev->tuner->set_gain_mode((void*)dev, mode);
        rtlsdr_set_i2c_repeater(dev, 0);
    }

    return r;
}

int rtlsdr_set_sample_rate(rtlsdr_dev_t* dev, uint32_t samp_rate)
{
    int r = 0;
    uint16_t tmp;
    uint32_t rsamp_ratio, real_rsamp_ratio;
    double real_rate;

    if (!dev)
        return -1;

    /* check if the rate is supported by the resampler */
    if ((samp_rate <= 225000) || (samp_rate > 3200000) ||
        ((samp_rate > 300000) && (samp_rate <= 900000)))
    {
        fprintf(stderr, "Invalid sample rate: %lu Hz\n", samp_rate);
        return -EINVAL;
    }

    rsamp_ratio = (dev->rtl_xtal * TWO_POW(22)) / samp_rate;
    rsamp_ratio &= 0x0ffffffc;

    real_rsamp_ratio = rsamp_ratio | ((rsamp_ratio & 0x08000000) << 1);
    real_rate = (dev->rtl_xtal * TWO_POW(22)) / real_rsamp_ratio;

    if (((double)samp_rate) != real_rate)
        fprintf(stderr, "Exact sample rate is: %f Hz\n", real_rate);

    dev->rate = (uint32_t)real_rate;

    if (dev->tuner && dev->tuner->set_bw)
    {
        rtlsdr_set_i2c_repeater(dev, 1);
        dev->tuner->set_bw(dev, dev->bw > 0 ? dev->bw : dev->rate);
        rtlsdr_set_i2c_repeater(dev, 0);
    }

    tmp = (rsamp_ratio >> 16);
    r |= rtlsdr_demod_write_reg(dev, 1, 0x9f, tmp, 2);
    tmp = rsamp_ratio & 0xffff;
    r |= rtlsdr_demod_write_reg(dev, 1, 0xa1, tmp, 2);

    r |= rtlsdr_set_sample_freq_correction(dev, dev->corr);

    /* reset demod (bit 3, soft_rst) */
    r |= rtlsdr_demod_write_reg(dev, 1, 0x01, 0x14, 1);
    r |= rtlsdr_demod_write_reg(dev, 1, 0x01, 0x10, 1);

    /* recalculate offset frequency if offset tuning is enabled */
    if (dev->offs_freq)
        rtlsdr_set_offset_tuning(dev, 1);

    return r;
}

uint32_t rtlsdr_get_sample_rate(rtlsdr_dev_t* dev)
{
    if (!dev)
        return 0;

    return dev->rate;
}

int rtlsdr_set_testmode(rtlsdr_dev_t* dev, int on)
{
    if (!dev)
        return -1;

    return rtlsdr_demod_write_reg(dev, 0, 0x19, on ? 0x03 : 0x05, 1);
}

int rtlsdr_set_agc_mode(rtlsdr_dev_t* dev, int on)
{
    if (!dev)
        return -1;

    return rtlsdr_demod_write_reg(dev, 0, 0x19, on ? 0x25 : 0x05, 1);
}

int rtlsdr_set_direct_sampling(rtlsdr_dev_t* dev, int on)
{
    int r = 0;

    if (!dev)
        return -1;

    if (on)
    {
        if (dev->tuner && dev->tuner->exit)
        {
            rtlsdr_set_i2c_repeater(dev, 1);
            r = dev->tuner->exit(dev);
            rtlsdr_set_i2c_repeater(dev, 0);
        }

        /* disable Zero-IF mode */
        r |= rtlsdr_demod_write_reg(dev, 1, 0xb1, 0x1a, 1);

        /* disable spectrum inversion */
        r |= rtlsdr_demod_write_reg(dev, 1, 0x15, 0x00, 1);

        /* only enable In-phase ADC input */
        r |= rtlsdr_demod_write_reg(dev, 0, 0x08, 0x4d, 1);

        /* swap I and Q ADC, this allows to select between two inputs */
        r |= rtlsdr_demod_write_reg(dev, 0, 0x06, (on > 1) ? 0x90 : 0x80, 1);

        fprintf(stderr, "Enabled direct sampling mode, input %i\n", on);
        dev->direct_sampling = on;
    }
    else
    {
        if (dev->tuner && dev->tuner->init)
        {
            rtlsdr_set_i2c_repeater(dev, 1);
            r |= dev->tuner->init(dev);
            rtlsdr_set_i2c_repeater(dev, 0);
        }

        if ((dev->tuner_type == RTLSDR_TUNER_R820T) ||
            (dev->tuner_type == RTLSDR_TUNER_R828D))
        {
            r |= rtlsdr_set_if_freq(dev, R82XX_IF_FREQ);

            /* enable spectrum inversion */
            r |= rtlsdr_demod_write_reg(dev, 1, 0x15, 0x01, 1);
        }
        else
        {
            r |= rtlsdr_set_if_freq(dev, 0);

            /* enable In-phase + Quadrature ADC input */
            r |= rtlsdr_demod_write_reg(dev, 0, 0x08, 0xcd, 1);

            /* Enable Zero-IF mode */
            r |= rtlsdr_demod_write_reg(dev, 1, 0xb1, 0x1b, 1);
        }

        /* opt_adc_iq = 0, default ADC_I/ADC_Q datapath */
        r |= rtlsdr_demod_write_reg(dev, 0, 0x06, 0x80, 1);

        fprintf(stderr, "Disabled direct sampling mode\n");
        dev->direct_sampling = 0;
    }

    r |= rtlsdr_set_center_freq(dev, dev->freq);

    return r;
}

int rtlsdr_get_direct_sampling(rtlsdr_dev_t* dev)
{
    if (!dev)
        return -1;

    return dev->direct_sampling;
}

int rtlsdr_set_offset_tuning(rtlsdr_dev_t* dev, int on)
{
    int r = 0;
    int bw;

    if (!dev)
        return -1;

    if ((dev->tuner_type == RTLSDR_TUNER_R820T) ||
        (dev->tuner_type == RTLSDR_TUNER_R828D))
        return -2;

    if (dev->direct_sampling)
        return -3;

    /* based on keenerds 1/f noise measurements */
    dev->offs_freq = on ? ((dev->rate / 2) * 170 / 100) : 0;
    r |= rtlsdr_set_if_freq(dev, dev->offs_freq);

    if (dev->tuner && dev->tuner->set_bw)
    {
        rtlsdr_set_i2c_repeater(dev, 1);
        if (on)
        {
            bw = 2 * dev->offs_freq;
        }
        else if (dev->bw > 0)
        {
            bw = dev->bw;
        }
        else
        {
            bw = dev->rate;
        }
        dev->tuner->set_bw(dev, bw);
        rtlsdr_set_i2c_repeater(dev, 0);
    }

    if (dev->freq > dev->offs_freq)
        r |= rtlsdr_set_center_freq(dev, dev->freq); 

    return r;
}

int rtlsdr_get_offset_tuning(rtlsdr_dev_t* dev)
{
    if (!dev)
        return -1;

    return (dev->offs_freq) ? 1 : 0;
}

static rtlsdr_dongle_t* find_known_device(uint16_t vid, uint16_t pid)
{
    unsigned int i;
    rtlsdr_dongle_t* device = NULL;

    for (i = 0; i < sizeof(known_devices) / sizeof(rtlsdr_dongle_t); i++)
    {
        if (known_devices[i].vid == vid && known_devices[i].pid == pid)
        {
            device = &known_devices[i];
            break;
        }
    }

    return device;
}

void esp_action_get_dev_desc(rtlsdr_dev_t* dev)
{
    assert(dev->driver_obj->dev_hdl != NULL);
    fprintf(stderr, "Getting config descriptor\n");
    const usb_config_desc_t* config_desc;
    ESP_ERROR_CHECK(usb_host_get_active_config_descriptor(dev->driver_obj->dev_hdl, &config_desc));
    usb_print_config_descriptor(config_desc, NULL);
}

int rtlsdr_open(rtlsdr_dev_t** out_dev, uint8_t index, usb_host_client_handle_t client_hdl)
{
    int r;
    rtlsdr_dev_t* dev = NULL;
    uint8_t reg;

    dev = (rtlsdr_dev_t*)ps_malloc(sizeof(rtlsdr_dev_t));
    class_driver_t* driver_obj = (class_driver_t*)ps_calloc(1, sizeof(class_driver_t));
    if (NULL == dev)
        return -ENOMEM;

